app/controllers/shortenings_controller.rb

INSERT INTO "shortenings" ("updated_at", "url", "created_at") VALUES('2009-09-18 16:29:45', 'http://coryforsyth.com/', '2009-09-18 16:29:45')
---
  def create
    @shortening = Shortening.new(params[:shortening])
    if @shortening.save

SELECT * FROM "shortenings" WHERE ("shortenings"."id" = 1)
---
  def show
    @shortening = Shortening.find(params[:id])